/*:
 * @plugindesc サブ文字描画用スプライトID設定
 * @author umaaji298
 *
 * @help プラグインコマンド
 * CheckSubSpriteFrame
 *
 */

;
(function () {
  'use strict'

  var pluginName = 'CheckSubSpriteFrame'
  var index_list = [0, 7, 13, 16, 18, 24, 29, 36, 40, 42, 45, 47, 52, 57, 59, 64, 70, 74, 79, 82, 86, 92, 93, 96, 101, 103, 105, 106, 109, 110, 112, 118, 122, 123, 127, 133, 137, 138, 140, 142, 148, 149, 153, 155, 159, 160, 161, 163, 164, 167, 169, 170, 171, 174, 178, 182, 184, 189, 192, 193, 194, 195]
  var spliteList = [
    [61, 17],
    [61, 5],
    [23, 34],
    [23, 34],
    [1, 17],
    [61, 30],
    [61, 29],
    [0, 17],
    [61, 22],
    [61, 22],
    [61, 22],
    [61, 1],
    [61, 45],
    [61, 17],
    [17, 18],
    [61, 10],
    [48, 17],
    [48, 17],
    [61, 17],
    [61, 71],
    [61, 9],
    [43, 38],
    [61, 6],
    [61, 61],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 6],
    [30, 43],
    [61, 17],
    [64, 17],
    [9, 3],
    [36, 2],
    [69, 5],
    [65, 17],
    [65, 17],
    [61, 17],
    [47, 17],
    [61, 39],
    [61, 3],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 42],
    [61, 61],
    [61, 17],
    [61, 17],
    [35, 17],
    [61, 61],
    [61, 61],
    [34, 17],
    [61, 38],
    [66, 17],
    [61, 11],
    [61, 7],
    [62, 17],
    [61, 18],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 54],
    [2, 52],
    [2, 52],
    [62, 52],
    [61, 17],
    [61, 17],
    [56, 45],
    [30, 38],
    [61, 22],
    [61, 22],
    [61, 17],
    [61, 45],
    [61, 45],
    [61, 45],
    [61, 17],
    [61, 39],
    [61, 0],
    [61, 70],
    [61, 70],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 12],
    [1, 17],
    [30, 38],
    [61, 17],
    [17, 17],
    [61, 62],
    [10, 8],
    [61, 45],
    [21, 34],
    [18, 17],
    [61, 3],
    [61, 48],
    [61, 8],
    [61, 17],
    [61, 41],
    [61, 9],
    [61, 17],
    [61, 40],
    [61, 2],
    [61, 2],
    [61, 17],
    [18, 11],
    [7, 17],
    [33, 17],
    [15, 17],
    [61, 47],
    [61, 42],
    [61, 11],
    [61, 2],
    [61, 17],
    [61, 45],
    [61, 30],
    [62, 30],
    [61, 18],
    [61, 45],
    [61, 17],
    [61, 17],
    [61, 7],
    [61, 7],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 46],
    [61, 11],
    [61, 17],
    [61, 7],
    [61, 2],
    [61, 16],
    [40, 17],
    [61, 15],
    [61, 17],
    [61, 30],
    [40, 6],
    [61, 7],
    [3, 17],
    [61, 17],
    [61, 11],
    [13, 17],
    [38, 0],
    [61, 17],
    [17, 17],
    [61, 17],
    [25, 17],
    [61, 16],
    [61, 7],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 0],
    [61, 0],
    [61, 70],
    [54, 15],
    [5, 45],
    [5, 45],
    [61, 20],
    [62, 1],
    [61, 17],
    [63, 17],
    [17, 17],
    [17, 17],
    [0, 17],
    [61, 17],
    [17, 17],
    [61, 12],
    [61, 17],
    [33, 45],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 33],
    [61, 18],
    [1, 17],
    [61, 6],
    [61, 47],
    [61, 42],
    [61, 0],
    [61, 17],
    [61, 5],
    [61, 5],
    [61, 12],
    [61, 7],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 17],
    [61, 40],
    [61, 9],
    [61, 9],
    [61, 15],
    [61, 58],
    [17, 17],
    [61, 9],
    [61, 61],
    [61, 61]
  ]

  // プラグインコマンドの定義
  var _Game_Interpreter_pluginCommand = Game_Interpreter.prototype.pluginCommand

  Game_Interpreter.prototype.pluginCommand = function (command, args) {
    _Game_Interpreter_pluginCommand.call(this, command, args)

    if (command === pluginName) {
      //スロットフレーム番号から補助文字のフレームnoを算出する
      // spliteList[index_list[currentno] + sub_address]で補助文字のフレームnoのデータを取り出す

      //index_list
      //spliteListの文字の先頭
      //「あ」の開始位置「い」の開始位置・・・・のこと

      //sub_addressについて
      //システム上「あ」が複数あるなどの重複が認められているので
      //何回重複されたかの変数が current_num + 21に格納されている

      //スロット文字(no)取得 (0-56)
      var current_num = $gameVariables.value(1);
      //現在の重複カウント数からindexを算出 (0 origin)
      var sub_address = $gameVariables.value(current_num + 121);

      chkSpriteFrame(current_num, sub_address)

      //滅茶苦茶大事なlog
      // console.log(
      //   'CheckSubSpriteFrame v1,count,v2,v3',
      //   $gameVariables.value(1),
      //   sub_address, $gameVariables.value(2),
      //   $gameVariables.value(3)
      // )
    }
  }

  function chkSpriteFrame(num, sub_address) {
    var currentSpliteflameNo = spliteList[index_list[num] + sub_address]
    $gameVariables.setValue(2, currentSpliteflameNo[0]) // 小文字フレームno
    $gameVariables.setValue(3, currentSpliteflameNo[1]) // 2文字目フレームno

  }

})()